app/controllers/timetable_entries_controller.rb

  def new
    @timetable =Timetable.find(params[:timetable_id])
---
SELECT * FROM `timetables` WHERE (`timetables`.`id` = 1) ORDER BY start_date ASC

  def new_entry
    @timetable=Timetable.find(params[:timetable_id])
    if params[:batch_id] == ""
      render :update do |page|
        page.replace_html "render_area", :text => ""
      end
      return
    end
    @batch = Batch.find(params[:batch_id])
---
SELECT * FROM `timetables` WHERE (`timetables`.`id` = 2) ORDER BY start_date ASC
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)